{
  "metadata": {
    "audioFile": "sample_meeting.wav",
    "totalDuration": 133.5,
    "sampleRate": 44100,
    "channels": 1
  },
  "segments": [
    {
      "text": "Welcome to today's meeting. I'd like to start by reviewing our quarterly results and discussing the upcoming product launch.",
      "start": 0.0,
      "end": 8.5,
      "speaker": "SPEAKER_00"
    },
    {
      "text": "Thank you for organizing this meeting. I have the latest sales figures ready to present.",
      "start": 9.2,
      "end": 15.8,
      "speaker": "SPEAKER_01"
    },
    {
      "text": "Great! Let's begin with the Q3 performance metrics. Our revenue increased by 23% compared to last quarter.",
      "start": 16.5,
      "end": 25.1,
      "speaker": "SPEAKER_00"
    },
    {
      "text": "That's excellent news. The marketing campaign we launched in July really paid off. Customer acquisition costs decreased by 15%.",
      "start": 25.8,
      "end": 35.2,
      "speaker": "SPEAKER_02"
    },
    {
      "text": "I agree. The social media engagement metrics also show significant improvement. We saw a 40% increase in organic reach.",
      "start": 36.0,
      "end": 45.5,
      "speaker": "SPEAKER_01"
    },
    {
      "text": "Now let's discuss the product roadmap. We have three major features planned for the next release cycle.",
      "start": 46.2,
      "end": 54.8,
      "speaker": "SPEAKER_00"
    },
    {
      "text": "The first feature is the advanced analytics dashboard. Our development team estimates it will take 6 weeks to complete.",
      "start": 55.5,
      "end": 64.1,
      "speaker": "SPEAKER_03"
    },
    {
      "text": "What about the mobile app integration? That was a high priority item from our customer feedback survey.",
      "start": 65.0,
      "end": 72.8,
      "speaker": "SPEAKER_02"
    },
    {
      "text": "The mobile integration is scheduled for phase two. We're targeting a beta release by the end of November.",
      "start": 73.5,
      "end": 81.2,
      "speaker": "SPEAKER_03"
    },
    {
      "text": "Excellent. I think we should also consider the API improvements that were requested by our enterprise clients.",
      "start": 82.0,
      "end": 89.7,
      "speaker": "SPEAKER_01"
    },
    {
      "text": "That's a good point. The API enhancements will improve performance and add new authentication methods.",
      "start": 90.5,
      "end": 98.3,
      "speaker": "SPEAKER_03"
    },
    {
      "text": "Before we wrap up, let's review the budget allocation for Q4. We have additional funding for the engineering team.",
      "start": 99.1,
      "end": 107.8,
      "speaker": "SPEAKER_00"
    },
    {
      "text": "The budget increase will allow us to hire two additional developers and a UX designer.",
      "start": 108.5,
      "end": 115.9,
      "speaker": "SPEAKER_02"
    },
    {
      "text": "That's perfect timing. We'll need the extra resources to meet our ambitious Q1 goals for next year.",
      "start": 116.7,
      "end": 124.2,
      "speaker": "SPEAKER_01"
    },
    {
      "text": "I'll send out the meeting notes and action items by end of day. Thank you everyone for your time and contributions.",
      "start": 125.0,
      "end": 133.5,
      "speaker": "SPEAKER_00"
    }
  ]
}
